STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB07CC/Applications/BLE/BLE_PowerControl_Peripheral/STM32_BLE/App/app_ble.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    app_ble.c
  * @author  GPM WBL Application Team
  * @brief   BLE Application
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include "main.h"
#include "stm32wb0x.h"
#include "ble.h"
#include "gatt_profile.h"
#include "gap_profile.h"
#include "app_ble.h"
#include "stm32wb0x_hal_radio_timer.h"
#include "bleplat.h"
#include "nvm_db.h"
#include "blenvm.h"
#include "pka_manager.h"
#include "stm32_seq.h"
#include "powercontrol_p.h"
#include "powercontrol_p_app.h"
/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/**
 * Security parameters structure
 */
typedef struct
{
  /**
   * IO capability of the device
   */
  uint8_t ioCapability;

  /**
   * Authentication requirement of the device
   * Man In the Middle protection required?
   */
  uint8_t mitm_mode;

  /**
   * bonding mode of the device
   */
  uint8_t bonding_mode;

  /**
   * minimum encryption key size requirement
   */
  uint8_t encryptionKeySizeMin;

  /**
   * maximum encryption key size requirement
   */
  uint8_t encryptionKeySizeMax;

  /**
   * this flag indicates whether the host has to initiate
   * the security, wait for pairing or does not have any security
   * requirements.
   * 0x00 : no security required
   * 0x01 : host should initiate security by sending the security
   *        request command
   * 0x02 : host need not send the clave security request but it
   * has to wait for paiirng to complete before doing any other
   * processing
   */
  uint8_t initiateSecurity;
  /* USER CODE BEGIN tSecurityParams*/

  /* USER CODE END tSecurityParams */
}SecurityParams_t;

/**
 * Global context contains all BLE common variables.
 */
typedef struct
{
  /**
   * security requirements of the host
   */
  SecurityParams_t bleSecurityParam;

  /**
   * gap service handle
   */
  uint16_t gapServiceHandle;

  /**
   * device name characteristic handle
   */
  uint16_t devNameCharHandle;

  /**
   * appearance characteristic handle
   */
  uint16_t appearanceCharHandle;

  /**
   * connection handle of the current active connection
   * When not in connection, the handle is set to 0xFFFF
   */
  uint16_t connectionHandle;
  /* USER CODE BEGIN BleGlobalContext_t*/

  /* USER CODE END BleGlobalContext_t */
}BleGlobalContext_t;

typedef struct
{
  BleGlobalContext_t BleApplicationContext_legacy;
  APP_BLE_ConnStatus_t Device_Connection_Status;
  /* USER CODE BEGIN PTD_1*/
  
  /* LED2 Timeout timerID. It is used to turn off LED2, 5ms after radio activity is received. */
  VTIMER_HandleType Advertising_Switch_Off_Led_timer_Id;
  
  /* LED1 timerID. LED1 Behavior Based on Path Loss Zones.
   * The LED1 blinks at different rates depending on the path loss zone:
   * - High Rate: LED1 blinks at a high rate in the low path loss zone (boards close to each other).
   * - Medium Rate: LED1 blinks at a medium rate in the medium path loss zone.
   * - Low Rate: LED1 blinks at a low rate in the high path loss zone (boards far from each other).
   * - No Evt: LED1 always ON means that no hci_le_transmit_power_reporting_event has been received.
   */
  VTIMER_HandleType Path_Loss_LED_timer_Id;

  uint8_t connIntervalFlag;
  /* USER CODE END PTD_1 */
}BleApplicationContext_t;

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define ADV_SWITCH_OFF_LED2_TIMEOUT_MS                                       (5)
#define ADV_TIMEOUT_MS                                               (60 * 1000)

/* Values for power control */
#define RSSI_TARGET_1M              -65  // dBm
#define RSSI_TARGET_2M              -62  // dBm
#define RSSI_TARGET_CODED_S8        -72  // dBm
#define RSSI_TARGET_CODED_S2        -68  // dBm
#define RSSI_HYSTERESIS              10  // dB

/* Values for path loss monitoring */
#define HIGH_THRESHOLD      74  // dB
#define HIGH_HYSTERESIS     6   // dB
#define LOW_THRESHOLD       55  // dB
#define LOW_HYSTERESIS      6   // dB
#define MIN_TIME            6   // Connection events

#define PATHLOSS_LOW_LED_INTERVAL_MS    100
#define PATHLOSS_MID_LED_INTERVAL_MS    300
#define PATHLOSS_HIGH_LED_INTERVAL_MS   600

/* USER CODE END PD */
/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */
/* Private variables ---------------------------------------------------------*/

NO_INIT(uint32_t dyn_alloc_a[BLE_DYN_ALLOC_SIZE>>2]);

static BleApplicationContext_t bleAppContext;

POWERCONTROL_P_APP_ConnHandleNotEvt_t POWERCONTROL_PHandleNotification;

static const char a_GapDeviceName[] = {  'P', 'o', 'w', 'e', 'r', 'C', 'o', 'n', 't', 'r', 'o', 'l', '_', 'P', 'e', 'r', 'i', 'p', 'h', 'e', 'r', 'a', 'l' }; /* Gap Device Name */

/**
 * Advertising Data
 */
uint8_t a_AdvData[] =
{
  2, AD_TYPE_FLAGS, FLAG_BIT_LE_GENERAL_DISCOVERABLE_MODE|FLAG_BIT_BR_EDR_NOT_SUPPORTED,
  10, AD_TYPE_COMPLETE_LOCAL_NAME, 'P', 'o', 'w', 'e', 'r', 'C', '_', 'X', 'X',  /* Complete name */
  15, AD_TYPE_MANUFACTURER_SPECIFIC_DATA, 0x30, 0x00, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */,
};

/* USER CODE BEGIN PV */

uint8_t path_loss_zone = 0;
const uint16_t path_loss_interval[] = {PATHLOSS_LOW_LED_INTERVAL_MS, PATHLOSS_MID_LED_INTERVAL_MS, PATHLOSS_HIGH_LED_INTERVAL_MS, 1000};
const char* path_loss_zone_str[] = {"PATHLOSS_LOW", "PATHLOSS_MID", "PATHLOSS_HIGH"};
/* 
 * Possible values for PHY (Physical Layer):
 * - 0x01: HCI_PHY_LE_1M       // LE 1M PHY (1 Mbps)
 * - 0x03: HCI_PHY_LE_CODED    // LE Coded PHY (Long range)
 */
static uint8_t phy = LE_1M_PHY_BIT;
/* USER CODE END PV */

