STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB07CC/Applications/BLE/BLE_PowerControl_Peripheral/STM32_BLE/App/app_ble.c
      /* Start Fast or Low Power Advertising using Coded Phy */

      /* Set advertising configuration for legacy advertising */
      status = aci_gap_set_advertising_configuration(coded_phy_handle,
                                                     GAP_MODE_GENERAL_DISCOVERABLE,
                                                     HCI_ADV_EVENT_PROP_CONNECTABLE,  /* Proper adv_type to use the Coded Phy*/
                                                     paramA,
                                                     paramB,
                                                     HCI_ADV_CH_ALL,
                                                     0,
                                                     NULL, /* No peer address */
                                                     HCI_ADV_FILTER_NONE,
                                                     0, /* 0 dBm */
                                                     HCI_PHY_LE_CODED, /* Primary advertising PHY */
                                                     0, /* 0 skips */
                                                     HCI_PHY_LE_CODED, /* Secondary advertising PHY. Not used with legacy advertising. */
                                                     0, /* SID */
                                                     0 /* No scan request notifications */);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("==>> (CODED PHY) aci_gap_set_advertising_configuration - fail, result: 0x%02X\n", status);
      }
      else
      {
        bleAppContext.Device_Connection_Status = (APP_BLE_ConnStatus_t)paramC;
        APP_DBG_MSG("==>> (CODED PHY) Success: aci_gap_set_advertising_configuration\n");
      }

      status = aci_gap_set_advertising_data(coded_phy_handle, ADV_COMPLETE_DATA, sizeof(a_AdvData), (uint8_t*) a_AdvData);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("==>> (CODED PHY) aci_gap_set_advertising_data Failed, result: 0x%02X\n", status);
      }
      else
      {
        APP_DBG_MSG("==>> (CODED PHY) Success: aci_gap_set_advertising_data\n");
      }

      /* Enable advertising */
      status = aci_gap_set_advertising_enable(ENABLE, 1, &Advertising_Set_Parameters);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("==>> (CODED PHY) aci_gap_set_advertising_enable Failed, result: 0x%02X\n", status);
      }
      else
      {
        APP_DBG_MSG("==>> (CODED PHY) Success: aci_gap_set_advertising_enable\n");
      }
      break;
    }/* PROC_GAP_PERIPH_ADVERTISE_START_CODED_PHY */
    /* USER CODE END GAP_PERIPHERAL_2 */
    default:
      break;
  }
  return;
}

/* USER CODE BEGIN FD*/

/* USER CODE END FD*/

static void gap_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}

static void gap_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}
/* USER CODE BEGIN FD_LOCAL_FUNCTION */


static void Switch_OFF_GPIO(void *arg)
{
  BSP_LED_Off(LD2);
  return;
}


void hci_le_phy_update_complete_event(uint8_t Status,
                                      uint16_t Connection_Handle,
                                      uint8_t TX_PHY,
                                      uint8_t RX_PHY)
{
  if(TX_PHY == HCI_TX_PHY_LE_CODED && RX_PHY == HCI_RX_PHY_LE_CODED)
  {
    /* Coded Phy Led3 On*/
    BSP_LED_On(LD3);
    APP_DBG_MSG("  PHY changed, tx:%d rx:%d Coded Phy Led3 On\n", TX_PHY, RX_PHY);
  }
  else 
  {
    if(TX_PHY == HCI_TX_PHY_LE_1M && RX_PHY == HCI_RX_PHY_LE_1M)
    {
      /* 1M Led3 Off */
      BSP_LED_Off(LD3);
      APP_DBG_MSG("  PHY changed, tx:%d rx:%d 1M Led3 Off\n", TX_PHY, RX_PHY);
    }    
    else 
    {
      APP_DBG_MSG("  PHY changed Unexpected, tx:%d rx:%d 1M Led3 Off\n", TX_PHY, RX_PHY);
      for(int i=0; i<10; i++)
      {
        BSP_LED_Toggle(LD3);
        HAL_Delay(500);
      }
    }
  }

}



void hci_le_transmit_power_reporting_event(uint8_t Status,
                                           uint16_t Connection_Handle,
                                           uint8_t Reason,
                                           uint8_t PHY,
                                           int8_t Transmit_Power_Level,
                                           uint8_t Transmit_Power_Level_Flag,
                                           int8_t Delta)
{
  if(Reason==LOCAL_TX_POWER_CHANGE)
  {
    APP_DBG_MSG("  hci_le_transmit_power_reporting_event - Local: %d dBm (%d dB)\n", Transmit_Power_Level, Delta);
  }
  else
  {
    APP_DBG_MSG("  hci_le_transmit_power_reporting_event - Remote: %d dBm (%d dB)\n", Transmit_Power_Level, Delta);
  }
}

void hci_le_path_loss_threshold_event(uint16_t Connection_Handle,
                                      uint8_t Current_Path_Loss,
                                      uint8_t Zone_Entered)
{
  APP_DBG_MSG("  hci_le_path_loss_threshold_event - PATH LOSS: %d dB (zone %d)\n", Current_Path_Loss, Zone_Entered);
  path_loss_zone = Zone_Entered;
}

void Path_Loss_LED_TimeoutCB(void *param)
{
  if(path_loss_zone == 3U)
  {
    BSP_LED_On(LD1);
    /* Led1 ON: the hci_le_transmit_power_reporting_event has not been received. */
  }
  else
  {
#if CFG_LPM_SUPPORTED && defined(PWR_IOxCFG_IOCFG6)
    uint32_t tmp = LL_PWR_GetPA6OutputinDEEPSTOP();
    if(tmp==LL_PWR_IOCFG_HIGH)
      LL_PWR_SetPA6OutputinDEEPSTOP(LL_PWR_IOCFG_LOW);
    else
      LL_PWR_SetPA6OutputinDEEPSTOP(LL_PWR_IOCFG_HIGH);
#else
    BSP_LED_Toggle(LD1);
#endif
  }
  HAL_RADIO_TIMER_StartVirtualTimer(&bleAppContext.Path_Loss_LED_timer_Id, path_loss_interval[path_loss_zone]);
}


/* USER CODE END FD_LOCAL_FUNCTION */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
#if (CFG_BUTTON_SUPPORTED == 1)
void APPE_Button1Action(void)
{
  if(bleAppContext.Device_Connection_Status == APP_BLE_ADV_CODED_PHY)
  {
    /* Stop the ongoing advertising to start the advertisement with Coded PHY */
    APP_DBG_MSG("  Stop the ongoing advertising to start the advertisement with 1M\n");
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
    bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
  }
  else
  {
    if(bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_SERVER)
    {
      APP_DBG_MSG("Terminate the connection with the central device.\n");
      APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_CONN_TERMINATE);
      //bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    }
  }
  
  if (bleAppContext.Device_Connection_Status == APP_BLE_IDLE)
  {
    APP_DBG_MSG("Relaunch advertising\n");
    /* Relaunch advertising */
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);
    /* 1M Led3 Off */
    BSP_LED_Off(LD3);
  }

  return;
}

void APPE_Button2Action(void)
{
  
  return;
}

void APPE_Button3Action(void)
{

  if (bleAppContext.Device_Connection_Status == APP_BLE_ADV_FAST || bleAppContext.Device_Connection_Status == APP_BLE_ADV_LP )
  {
    /* Stop the ongoing advertising to start the advertisement with Coded PHY */
    APP_DBG_MSG("  Stop the ongoing advertising to start the advertisement with Coded PHY\n");
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
    bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
  }
  else
  {
    if (bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_SERVER )
    {
      APP_DBG_MSG("Terminate the connection with the central device.\n");
      APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_CONN_TERMINATE);
      bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    }
  }
  
  /* Relaunch advertising with Coded Phy */
  if (bleAppContext.Device_Connection_Status == APP_BLE_IDLE)
  {
    APP_DBG_MSG("(CODED PHY) Relaunch advertising\n");
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_CODED_PHY);
    /* Coded Phy Led3 On */
    BSP_LED_Off(LD3);
  }

  return;
}
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
 */
